In [1]:
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import os
import sys
%matplotlib inline

In [4]:
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'London', 'Paris', 'Tokyo'],
    'price': [100, 200, 300, 400, 500, 600, 700, 800]
})

In [5]:
df

       city  price
0  New York    100
1    London    200
2     Paris    300
3     Tokyo    400
4  New York    500
5    London    600
6     Paris    700
7     Tokyo    800

In [9]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [10]:
mean_price

{'London': 400.0, 'New York': 300.0, 'Paris': 500.0, 'Tokyo': 600.0}

In [11]:
df['city_mean_price'] = df['city'].map(mean_price)

In [14]:
df

       city  price  city_mean_price
0  New York    100            300.0
1    London    200            400.0
2     Paris    300            500.0
3     Tokyo    400            600.0
4  New York    500            300.0
5    London    600            400.0
6     Paris    700            500.0
7     Tokyo    800            600.0

In [13]:
df[['price', 'city_mean_price']]

   price  city_mean_price
0    100            300.0
1    200            400.0
2    300            500.0
3    400            600.0
4    500            300.0
5    600            400.0
6    700            500.0
7    800            600.0

In [15]:
print("The End")

The End